Enums/КИИ_ТипыПодключенияMCP.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>КИИ_ТипыПодключенияMCP</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>HTTP</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>StreamableHTTP</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>SSE</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/КИИ_ТипыАвторизации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>КИИ_ТипыАвторизации</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ApiKey</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Bearer</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>OAuth2ClientCredentials</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>XApiKey</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/КИИ_ИнструментыИИ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>КИИ_ИнструментыИИ</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.КИИ_MCPСерверы</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПараметрыJSON</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/КИИ_MCPСерверы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>КИИ_MCPСерверы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Адрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресЗапроса</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяПоляТекста</Name>
					<Comment>Возможно content или text</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьЗащищенноеСоединение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипАвторизации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КИИ_ТипыАвторизации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПодключения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.КИИ_ТипыПодключенияMCP</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Заголовки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Ключ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/КИИ_КоннекторMCP/Ext/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// SPDX-License-Identifier: MIT
// Copyright (c) 2026 Андриянов Роман (Androman.pro)
// https://opensource.org/license/mit
////////////////////////////////////////////////////////////////////////////////

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Подключается к MCP-серверу, получает список инструментов (tools/list)
// и записывает их в справочник КИИ_ИнструментыИИ
//
// Параметры:
//  MCPСервер - СправочникСсылка.КИИ_MCPСерверы - MCP-сервер для обновления
//
// Возвращаемое значение:
//  Структура:
//    * Успешно - Булево
//    * КоличествоИнструментов - Число - количество загруженных инструментов
//    * ТекстОшибки - Строка - описание ошибки (при Успешно = Ложь)
//
Функция ПодключитьИОбновитьИнструменты(MCPСервер) Экспорт

	Результат = Новый Структура;
	Результат.Вставить("Успешно", Ложь);
	Результат.Вставить("КоличествоИнструментов", 0);
	Результат.Вставить("ТекстОшибки", "");

	Попытка
		ПараметрыСервера = ПараметрыMCPСервера(MCPСервер);
		КлючAPI = ПолучитьКлючAPI(MCPСервер);

		// Выполнить запрос tools/list
		РезультатСписка = ВыполнитьToolsList(ПараметрыСервера, КлючAPI);

		Если Не РезультатСписка.Успешно Тогда
			Результат.ТекстОшибки = РезультатСписка.ТекстОшибки;
			ЗаписьЖурналаРегистрации(
				НСтр("ru = 'КИИ.MCP.ОбновлениеИнструментов'", ОбщегоНазначения.КодОсновногоЯзыка()),
				УровеньЖурналаРегистрации.Ошибка,
				Метаданные.Справочники.КИИ_MCPСерверы,
				MCPСервер,
				РезультатСписка.ТекстОшибки);
			Возврат Результат;
		КонецЕсли;

		// Записать/обновить инструменты в справочник
		КоличествоИнструментов = ЗаписатьИнструментыВСправочник(
			MCPСервер, РезультатСписка.Инструменты);

		Результат.Успешно = Истина;
		Результат.КоличествоИнструментов = КоличествоИнструментов;

		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'КИИ.MCP.ОбновлениеИнструментов'", ОбщегоНазначения.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Информация,
			Метаданные.Справочники.КИИ_MCPСерверы,
			MCPСервер,
			СтрШаблон(НСтр("ru = 'Обновлено %1 инструментов'"), КоличествоИнструментов));

	Исключение
		Результат.ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'КИИ.MCP.ОбновлениеИнструментов'", ОбщегоНазначения.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка,
			Метаданные.Справочники.КИИ_MCPСерверы,
			MCPСервер,
			Результат.ТекстОшибки);
	КонецПопытки;

	Возврат Результат;

КонецФункции

// Вызывает инструмент на MCP-сервере через tools/call
//
// Параметры:
//  MCPСервер - СправочникСсылка.КИИ_MCPСерверы - MCP-сервер
//  ИмяИнструмента - Строка - имя вызываемого инструмента
//  АргументыJSON - Строка - JSON-строка с аргументами инструмента
//
// Возвращаемое значение:
//  Структура:
//    * Успешно - Булево
//    * ТекстРезультата - Строка - текстовый результат вызова
//    * ТекстОшибки - Строка - описание ошибки (при Успешно = Ложь)
//
Функция ВызватьИнструмент(MCPСервер, ИмяИнструмента, АргументыJSON) Экспорт

	Результат = Новый Структура;
	Результат.Вставить("Успешно", Ложь);
	Результат.Вставить("ТекстРезультата", "");
	Результат.Вставить("ТекстОшибки", "");

	Попытка
		ПараметрыСервера = ПараметрыMCPСервера(MCPСервер);
		КлючAPI = ПолучитьКлючAPI(MCPСервер);

		// Выполнить запрос tools/call
		РезультатВызова = ВыполнитьToolsCall(
			ПараметрыСервера, КлючAPI, ИмяИнструмента, АргументыJSON);

		Если Не РезультатВызова.Успешно Тогда
			Результат.ТекстОшибки = РезультатВызова.ТекстОшибки;

			ЗаписьЖурналаРегистрации(
				НСтр("ru = 'КИИ.MCP.ВызовИнструмента'", ОбщегоНазначения.КодОсновногоЯзыка()),
				УровеньЖурналаРегистрации.Ошибка,
				Метаданные.Справочники.КИИ_MCPСерверы,
				MCPСервер,
				СтрШаблон(НСтр("ru = 'Ошибка вызова инструмента %1: %2'"),
					ИмяИнструмента, РезультатВызова.ТекстОшибки));

			Возврат Результат;
		КонецЕсли;

		Результат.Успешно = Истина;
		Результат.ТекстРезультата = РезультатВызова.ТекстРезультата;

	Исключение
		Результат.ТекстОшибки = ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
	КонецПопытки;

	Возврат Результат;

КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// (зарезервировано для будущих расширений)

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ПодключениеИОбновление

// Выполняет запрос tools/list к MCP-серверу
//
// Параметры:
//  ПараметрыСервера - Структура - параметры MCP-сервера (от ПараметрыMCPСервера)
//  КлючAPI - Строка - API-ключ для авторизации
//
// Возвращаемое значение:
//  Структура:
//    * Успешно - Булево
//    * Инструменты - Массив из Структура - массив инструментов:
//        ** Имя - Строка
//        ** Описание - Строка
//        ** ПараметрыJSON - Строка (JSON Schema)
//    * ТекстОшибки - Строка
//
Функция ВыполнитьToolsList(ПараметрыСервера, КлючAPI)

	Результат = Новый Структура;
	Результат.Вставить("Успешно", Ложь);
	Результат.Вставить("Инструменты", Новый Массив);
	Результат.Вставить("ТекстОшибки", "");

	// Формируем JSON-RPC 2.0 запрос tools/list
	ТелоJSON = СформироватьЗапросJSONRPC("tools/list", 1);

	// Выполняем HTTP-запрос к MCP-серверу
	ОтветHTTP = ВыполнитьЗапросКMCP(ПараметрыСервера, ТелоJSON, КлючAPI);

	Если Не ОтветHTTP.Успешно Тогда
		Результат.ТекстОшибки = ОтветHTTP.ТекстОшибки;
		Возврат Результат;
	КонецЕсли;

	// Парсим JSON-RPC ответ
	ОтветСтруктура = ИзвлечьРезультатJSONRPC(ОтветHTTP.ТелоОтвета, 1);

	Если Не ОтветСтруктура.Успешно Тогда
		Результат.ТекстОшибки = ОтветСтруктура.ТекстОшибки;
		Возврат Результат;
	КонецЕсли;

	// Извлекаем массив инструментов из result.tools
	Данные = ОтветСтруктура.Данные;
	МассивИнструментов = Новый Массив;

	Если Не Данные.Свойство("tools") Тогда
		// tools/list вернул результат без массива инструментов
		Результат.Успешно = Истина;
		Результат.Инструменты = МассивИнструментов;
		Возврат Результат;
	КонецЕсли;

	Для Каждого Tool Из Данные.tools Цикл

		Инструмент = Новый Структура;
		Инструмент.Вставить("Имя", ?(Tool.Свойство("name"), Tool.name, ""));
		Инструмент.Вставить("Описание",
			?(Tool.Свойство("description"), Tool.description, ""));

		Если Tool.Свойство("inputSchema") Тогда
			Попытка
				Инструмент.Вставить("ПараметрыJSON",
					ОбщегоНазначения.ЗначениеВJSON(Tool.inputSchema));
			Исключение
				Инструмент.Вставить("ПараметрыJSON", "{}");
				ЗаписьЖурналаРегистрации(
					НСтр("ru = 'КИИ.MCP.ПарсингИнструментов'", ОбщегоНазначения.КодОсновногоЯзыка()),
					УровеньЖурналаРегистрации.Предупреждение,
					,
					,
					СтрШаблон(НСтр("ru = 'Ошибка сериализации inputSchema инструмента %1: %2'"),
						?(Tool.Свойство("name"), Tool.name, ""),
						ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке())));
			КонецПопытки;
		Иначе
			Инструмент.Вставить("ПараметрыJSON", "{}");
		КонецЕсли;

		МассивИнструментов.Добавить(Инструмент);

	КонецЦикла;

	Результат.Успешно = Истина;
	Результат.Инструменты = МассивИнструментов;
	Возврат Результат;

КонецФункции

// Записывает/обновляет инструменты в справочник КИИ_ИнструментыИИ
// и удаляет отсутствующие на сервере (синхронизация)
//
// Параметры:
//  MCPСервер - СправочникСсылка.КИИ_MCPСерверы - владелец
//  МассивИнструментов - Массив из Структура (от ВыполнитьToolsList)
//
// Возвращаемое значение:
//  Число - количество записанных инструментов
//
Функция ЗаписатьИнструментыВСправочник(MCPСервер, МассивИнструментов)

	// Собираем имена инструментов из ответа сервера
	ИменаСИнструментами = Новый Соответствие;
	Для Каждого Инструмент Из МассивИнструментов Цикл
		ИменаСИнструментами.Вставить(Инструмент.Имя, Инструмент);
	КонецЦикла;

	// Получаем существующие элементы справочника
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	КИИ_ИнструментыИИ.Ссылка КАК Ссылка,
		|	КИИ_ИнструментыИИ.Наименование КАК Наименование
		|ИЗ
		|	Справочник.КИИ_ИнструментыИИ КАК КИИ_ИнструментыИИ
		|ГДЕ
		|	КИИ_ИнструментыИИ.Владелец = &Владелец";
	Запрос.УстановитьПараметр("Владелец", MCPСервер);

	СуществующиеЭлементы = Новый Соответствие;
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СуществующиеЭлементы.Вставить(Выборка.Наименование, Выборка.Ссылка);
	КонецЦикла;

	Счетчик = 0;

	// Записываем/обновляем инструменты
	Для Каждого Инструмент Из МассивИнструментов Цикл

		Имя = Инструмент.Имя;
		Если ПустаяСтрока(Имя) Тогда
			Продолжить;
		КонецЕсли;

		Ссылка = СуществующиеЭлементы.Получить(Имя);
		ЭлементСправочника = Неопределено;

		Если Ссылка <> Неопределено Тогда
			ЭлементСправочника = Ссылка.ПолучитьОбъект();
		Иначе
			ЭлементСправочника = Справочники.КИИ_ИнструментыИИ.СоздатьЭлемент();
		КонецЕсли;

		ЭлементСправочника.Владелец = MCPСервер;
		ЭлементСправочника.Наименование = Имя;
		ЭлементСправочника.Описание = Инструмент.Описание;
		ЭлементСправочника.ПараметрыJSON = Инструмент.ПараметрыJSON;

		Попытка
			ЭлементСправочника.Записать();
			Счетчик = Счетчик + 1;
		Исключение
			ЗаписьЖурналаРегистрации(
				НСтр("ru = 'КИИ.MCP.ЗаписьИнструмента'", ОбщегоНазначения.КодОсновногоЯзыка()),
				УровеньЖурналаРегистрации.Ошибка,
				Метаданные.Справочники.КИИ_MCPСерверы,
				MCPСервер,
				СтрШаблон(НСтр("ru = 'Ошибка записи инструмента %1: %2'"),
					Имя,
					ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке())));
		КонецПопытки;

	КонецЦикла;

	// Удаляем элементы, отсутствующие в ответе сервера
	Для Каждого КлючИЗначение Из СуществующиеЭлементы Цикл
		Если ИменаСИнструментами.Получить(КлючИЗначение.Ключ) = Неопределено Тогда
			Попытка
				КлючИЗначение.Значение.ПолучитьОбъект().Удалить();
			Исключение
				ЗаписьЖурналаРегистрации(
					НСтр("ru = 'КИII.MCP.УдалениеИнструмента'", ОбщегоНазначения.КодОсновногоЯзыка()),
					УровеньЖурналаРегистрации.Предупреждение,
					Метаданные.Справочники.КИИ_MCPСерверы,
					MCPСервер,
					СтрШаблон(НСтр("ru = 'Ошибка удаления инструмента %1: %2'"),
						КлючИЗначение.Ключ,
						ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке())));
			КонецПопытки;
		КонецЕсли;
	КонецЦикла;

	Возврат Счетчик;

КонецФункции

#КонецОбласти

#Область ВызовИнструментов

// Выполняет запрос tools/call к MCP-серверу
//
// Параметры:
//  ПараметрыСервера - Структура
//  КлючAPI - Строка
//  ИмяИнструмента - Строка
//  АргументыJSON - Строка
//
// Возвращаемое значение:
//  Структура:
//    * Успешно - Булево
//    * ТекстРезультата - Строка
//    * ТекстОшибки - Строка
//
Функция ВыполнитьToolsCall(ПараметрыСервера, КлючAPI, ИмяИнструмента, АргументыJSON)

	Результат = Новый Структура;
	Результат.Вставить("Успешно", Ложь);
	Результат.Вставить("ТекстРезультата", "");
	Результат.Вставить("ТекстОшибки", "");

	// Формируем параметры запроса
	Params = Новый Структура;
	Params.Вставить("name", ИмяИнструмента);

	// Парсинг аргументов из JSON
	Попытка
		АргументыСтруктура = ОбщегоНазначения.JSONВЗначение(АргументыJSON, , Ложь);
	Исключение
		АргументыСтруктура = Новый Структура;
	КонецПопытки;
	Params.Вставить("arguments", АргументыСтруктура);

	// Формируем JSON-RPC 2.0 запрос tools/call
	ТелоJSON = СформироватьЗапросJSONRPC("tools/call", 2, Params);

	// Выполняем HTTP-запрос к MCP-серверу
	ОтветHTTP = ВыполнитьЗапросКMCP(ПараметрыСервера, ТелоJSON, КлючAPI);

	Если Не ОтветHTTP.Успешно Тогда
		Результат.ТекстОшибки = ОтветHTTP.ТекстОшибки;
		Возврат Результат;
	КонецЕсли;

	// Парсим JSON-RPC ответ
	ОтветСтруктура = ИзвлечьРезультатJSONRPC(ОтветHTTP.ТелоОтвета, 2);

	Если Не ОтветСтруктура.Успешно Тогда
		Результат.ТекстОшибки = ОтветСтруктура.ТекстОшибки;
		Возврат Результат;
	КонецЕсли;

	// Извлекаем текст результата
	ТекстРезультата = ИзвлечьТекстРезультатаИзОтвета(
		ОтветСтруктура.Данные, ПараметрыСервера.ИмяПоляТекста);

	Результат.Успешно = Истина;
	Результат.ТекстРезультата = ТекстРезультата;
	Возврат Результат;

КонецФункции

// Извлекает текст результата из ответа tools/call
//
// Параметры:
//  Данные - Структура - распарсенный result из JSON-RPC ответа
//  ИмяПоляТекста - Строка - имя поля с текстом ("text" или "content")
//
// Возвращаемое значение:
//  Строка - текст результата (объединенный из всех элементов content)
//
Функция ИзвлечьТекстРезультатаИзОтвета(Данные, ИмяПоляТекста)

	Результат = "";

	Если Данные = Неопределено Тогда
		Возврат Результат;
	КонецЕсли;

	Если Не Данные.Свойство("content") Тогда
		Возврат Результат;
	КонецЕсли;

	Если ТипЗнч(Данные.content) = Тип("Массив") Тогда
		Для Каждого Элемент Из Данные.content Цикл
			Если Элемент.Свойство("type") И Элемент.type = "text" Тогда
				Если ИмяПоляТекста = "content" И Элемент.Свойство("content") Тогда
					Результат = Результат + Элемент.content + Символы.ПС;
				Иначе
					Результат = Результат + Элемент.text + Символы.ПС;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;

	Возврат СокрЛП(Результат);

КонецФункции

#КонецОбласти

#Область JSONRPC

// Формирует JSON-RPC 2.0 запрос
//
// Параметры:
//  Метод - Строка - имя метода (например, "tools/list")
//  Идентификатор - Число - id запроса
//  Params - Структура, Неопределено - параметры запроса
//
// Возвращаемое значение:
//  Строка - JSON-строка запроса
//
Функция СформироватьЗапросJSONRPC(Метод, Идентификатор, Params = Неопределено)

	Запрос = Новый Структура;
	Запрос.Вставить("jsonrpc", "2.0");
	Запрос.Вставить("method", Метод);
	Запрос.Вставить("id", Идентификатор);

	Если Params <> Неопределено Тогда
		Запрос.Вставить("params", Params);
	КонецЕсли;

	Возврат ОбщегоНазначения.ЗначениеВJSON(Запрос);

КонецФункции

// Парсит JSON-RPC 2.0 ответ и извлекает результат
//
// Параметры:
//  ТелоОтвета - Строка - JSON-строка ответа
//  ОжидаемыйИдентификатор - Число - ожидаемый id ответа
//
// Возвращаемое значение:
//  Структура:
//    * Успешно - Булево
//    * Данные - Структура - значение поля "result" (при Успешно = Истина)
//    * ТекстОшибки - Строка (при Успешно = Ложь)
//
Функция ИзвлечьРезультатJSONRPC(ТелоОтвета, ОжидаемыйИдентификатор)

	Результат = Новый Структура;
	Результат.Вставить("Успешно", Ложь);
	Результат.Вставить("ТекстОшибки", "");

	Попытка
		ОтветJSON = ОбщегоНазначения.JSONВЗначение(ТелоОтвета, , Ложь);
	Исключение
		Результат.ТекстОшибки = СтрШаблон(
			НСтр("ru = 'Ошибка парсинга JSON-RPC ответа: %1'"),
			ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		Возврат Результат;
	КонецПопытки;

	// Проверяем версию jsonrpc
	Если Не ОтветJSON.Свойство("jsonrpc") ИЛИ ОтветJSON.jsonrpc <> "2.0" Тогда
		Результат.ТекстОшибки = НСтр("ru = 'Некорректный JSON-RPC ответ: отсутствует версия или версия не 2.0'");
		Возврат Результат;
	КонецЕсли;

	// Проверяем наличие id
	Если Не ОтветJSON.Свойство("id") Тогда
		Результат.ТекстОшибки = НСтр("ru = 'Некорректный JSON-RPC ответ: отсутствует id'");
		Возврат Результат;
	КонецЕсли;

	Если ОтветJSON.id <> ОжидаемыйИдентификатор Тогда
		Результат.ТекстОшибки = СтрШаблон(
			НСтр("ru = 'Несовпадение id JSON-RPC: ожидается %1, получено %2'"),
			ОжидаемыйИдентификатор, ОтветJSON.id);
		Возврат Результат;
	КонецЕсли;

	// Проверяем наличие ошибки
	Если ОтветJSON.Свойство("error") Тогда
		КодОшибки = 0;
		СообщениеОшибки = "";
		Если ОтветJSON.error.Свойство("code") Тогда
			КодОшибки = ОтветJSON.error.code;
		КонецЕсли;
		Если ОтветJSON.error.Свойство("message") Тогда
			СообщениеОшибки = ОтветJSON.error.message;
		КонецЕсли;
		Результат.ТекстОшибки = СтрШаблон(
			НСтр("ru = 'JSON-RPC ошибка %1: %2'"),
			КодОшибки, СообщениеОшибки);
		Возврат Результат;
	КонецЕсли;

	// Извлекаем результат
	Если Не ОтветJSON.Свойство("result") Тогда
		Результат.ТекстОшибки = НСтр("ru = 'Некорректный JSON-RPC ответ: отсутствует result'");
		Возврат Результат;
	КонецЕсли;

	Результат.Успешно = Истина;
	Результат.Вставить("Данные", ОтветJSON.result);
	Возврат Результат;

КонецФункции

#КонецОбласти

#Область ТипыПодключений

// Выполняет запрос к MCP-серверу с учетом типа подключения (главный диспетчер)
//
// Параметры:
//  ПараметрыСервера - Структура
//  ТелоJSON - Строка
//  КлючAPI - Строка
//
// Возвращаемое значение:
//  Структура:
//    * Успешно - Булево
//    * ТелоОтвета - Строка
//    * КодСостояния - Число
//    * ТекстОшибки - Строка
//
Функция ВыполнитьЗапросКMCP(ПараметрыСервера, ТелоJSON, КлючAPI)

	ТипПодключения = ПараметрыСервера.ТипПодключения;

	Попытка
		Если ТипПодключения = Перечисления.КИИ_ТипыПодключенияMCP.StreamableHTTP Тогда
			Возврат ВыполнитьЗапросStreamableHTTP(ПараметрыСервера, ТелоJSON, КлючAPI);
		ИначеЕсли ТипПодключения = Перечисления.КИИ_ТипыПодключенияMCP.SSE Тогда
			Возврат ВыполнитьЗапросSSE(ПараметрыСервера, ТелоJSON, КлючAPI);
		Иначе
			// По умолчанию -- HTTP
			Возврат ВыполнитьЗапросHTTP(ПараметрыСервера, ТелоJSON, КлючAPI);
		КонецЕсли;
	Исключение
		Результат = Новый Структура;
		Результат.Вставить("Успешно", Ложь);
		Результат.Вставить("ТелоОтвета", "");
		Результат.Вставить("КодСостояния", 0);
		Результат.Вставить("ТекстОшибки",
			ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		Возврат Результат;
	КонецПопытки;

КонецФункции

// Выполняет HTTP POST запрос к MCP-серверу (тип подключения: HTTP)
//
// Параметры:
//  ПараметрыСервера - Структура
//  ТелоJSON - Строка - JSON-тело запроса
//  КлючAPI - Строка
//
// Возвращаемое значение:
//  Структура:
//    * Успешно - Булево
//    * ТелоОтвета - Строка - тело HTTP-ответа
//    * КодСостояния - Число - HTTP-код ответа
//    * ТекстОшибки - Строка
//
Функция ВыполнитьЗапросHTTP(ПараметрыСервера, ТелоJSON, КлючAPI)

	Результат = Новый Структура;
	Результат.Вставить("Успешно", Ложь);
	Результат.Вставить("ТелоОтвета", "");
	Результат.Вставить("КодСостояния", 0);
	Результат.Вставить("ТекстОшибки", "");

	// Создаем HTTP-соединение
	Соединение = СоздатьHTTPСоединениеMCP(ПараметрыСервера);

	// Создаем HTTP-запрос
	ЗапросHTTP = Новый HTTPЗапрос(ПараметрыСервера.АдресЗапроса);

	// Устанавливаем заголовки
	ЗапросHTTP.Заголовки.Вставить("Content-Type", "application/json");
	ЗапросHTTP.Заголовки.Вставить("Accept", "application/json, text/event-stream");
	СформироватьЗаголовкиАвторизации(ЗапросHTTP, ПараметрыСервера.ТипАвторизации, КлючAPI);

	Для Каждого Заголовок Из ПараметрыСервера.Заголовки Цикл
		ЗапросHTTP.Заголовки.Вставить(Заголовок.Ключ, Заголовок.Значение);
	КонецЦикла;

	// Устанавливаем тело запроса
	ЗапросHTTP.УстановитьТелоИзСтроки(ТелоJSON, КодировкаТекста.UTF8);

	// Отправляем запрос
	ОтветHTTP = Соединение.ВызватьHTTPМетод("POST", ЗапросHTTP);

	Результат.КодСостояния = ОтветHTTP.КодСостояния;

	Если ОтветHTTP.КодСостояния <> 200 Тогда
		Результат.ТекстОшибки = СтрШаблон(
			НСтр("ru = 'HTTP-ошибка при обращении к MCP-серверу: %1'"),
			ОтветHTTP.КодСостояния);
		Попытка
			ТелоОтвета = ОтветHTTP.ПолучитьТелоКакСтроку();
			Если Не ПустаяСтрока(ТелоОтвета) Тогда
				Результат.ТекстОшибки = Результат.ТекстОшибки + ". " + ТелоОтвета;
			КонецЕсли;
		Исключение
		КонецПопытки;
		Возврат Результат;
	КонецЕсли;

	Результат.Успешно = Истина;
	Результат.ТелоОтвета = ОтветHTTP.ПолучитьТелоКакСтроку();
	Возврат Результат;

КонецФункции

// Выполняет HTTP POST запрос к MCP-серверу (тип подключения: StreamableHTTP)
// Ответ может содержать несколько JSON-RPC сообщений, разделенных \n\n (NDJSON)
//
// Параметры:
//  ПараметрыСервера - Структура
//  ТелоJSON - Строка
//  КлючAPI - Строка
//
// Возвращаемое значение:
//  Структура:
//    * Успешно - Булево
//    * ТелоОтвета - Строка - последнее JSON-RPC сообщение с нужным id
//    * КодСостояния - Число
//    * ТекстОшибки - Строка
//
Функция ВыполнитьЗапросStreamableHTTP(ПараметрыСервера, ТелоJSON, КлючAPI)

	Результат = Новый Структура;
	Результат.Вставить("Успешно", Ложь);
	Результат.Вставить("ТелоОтвета", "");
	Результат.Вставить("КодСостояния", 0);
	Результат.Вставить("ТекстОшибки", "");

	// Выполняем стандартный HTTP-запрос
	Соединение = СоздатьHTTPСоединениеMCP(ПараметрыСервера);
	ЗапросHTTP = Новый HTTPЗапрос(ПараметрыСервера.АдресЗапроса);

	ЗапросHTTP.Заголовки.Вставить("Content-Type", "application/json");
	ЗапросHTTP.Заголовки.Вставить("Accept", "application/json, text/event-stream, application/x-ndjson");
	СформироватьЗаголовкиАвторизации(ЗапросHTTP, ПараметрыСервера.ТипАвторизации, КлючAPI);

	Для Каждого Заголовок Из ПараметрыСервера.Заголовки Цикл
		ЗапросHTTP.Заголовки.Вставить(Заголовок.Ключ, Заголовок.Значение);
	КонецЦикла;

	ЗапросHTTP.УстановитьТелоИзСтроки(ТелоJSON, КодировкаТекста.UTF8);

	ОтветHTTP = Соединение.ВызватьHTTPМетод("POST", ЗапросHTTP);
	Результат.КодСостояния = ОтветHTTP.КодСостояния;

	Если ОтветHTTP.КодСостояния <> 200 Тогда
		Результат.ТекстОшибки = СтрШаблон(
			НСтр("ru = 'HTTP-ошибка при обращении к MCP-серверу (StreamableHTTP): %1'"),
			ОтветHTTP.КодСостояния);
		Возврат Результат;
	КонецЕсли;

	// Читаем полное тело ответа и парсим NDJSON
	ПолноеТело = ОтветHTTP.ПолучитьТелоКакСтроку();

	// Разбиваем тело по двойному переводу строки (NDJSON разделитель)
	МассивСообщений = СтрРазделить(ПолноеТело, Символы.ПС + Символы.ПС);

	// Извлекаем первое сообщение для определения ожидаемого id
	ОжидаемыйИдентификатор = 1; // по умолчанию
	Попытка
		ПервоеСообщение = СокрЛП(МассивСообщений[0]);
		Если Не ПустаяСтрока(ПервоеСообщение) Тогда
			ПервоеJSON = ОбщегоНазначения.JSONВЗначение(ПервоеСообщение, , Ложь);
			Если ПервоеJSON.Свойство("id") Тогда
				ОжидаемыйИдентификатор = ПервоеJSON.id;
			КонецЕсли;
		КонецЕсли;
	Исключение
	КонецПопытки;

	// Ищем последнее сообщение с нужным id
	ТелоОтветаРезультат = "";
	Для Каждого Сообщение Из МассивСообщений Цикл
		Сообщение = СокрЛП(Сообщение);
		Если ПустаяСтрока(Сообщение) Тогда
			Продолжить;
		КонецЕсли;
		Попытка
			СообщениеJSON = ОбщегоНазначения.JSONВЗначение(Сообщение, , Ложь);
			Если СообщениеJSON.Свойство("id") И СообщениеJSON.id = ОжидаемыйИдентификатор Тогда
				ТелоОтветаРезультат = Сообщение; // последнее сообщение с нужным id
			КонецЕсли;
		Исключение
			// Пропускаем некорректные фрагменты
		КонецПопытки;
	КонецЦикла;

	Если ПустаяСтрока(ТелоОтветаРезультат) Тогда
		Результат.ТекстОшибки = НСтр("ru = 'Не найдено JSON-RPC ответное сообщение в StreamableHTTP потоке'");
		Возврат Результат;
	КонецЕсли;

	Результат.Успешно = Истина;
	Результат.ТелоОтвета = ТелоОтветаРезультат;
	Возврат Результат;

КонецФункции

// Выполняет запрос к MCP-серверу (тип подключения: SSE)
// Ответ через поток Server-Sent Events (text/event-stream)
//
// Параметры:
//  ПараметрыСервера - Структура
//  ТелоJSON - Строка
//  КлючAPI - Строка
//
// Возвращаемое значение:
//  Структура:
//    * Успешно - Булево
//    * ТелоОтвета - Строка - извлеченный JSON-RPC ответ
//    * КодСостояния - Число
//    * ТекстОшибки - Строка
//
Функция ВыполнитьЗапросSSE(ПараметрыСервера, ТелоJSON, КлючAPI)

	Результат = Новый Структура;
	Результат.Вставить("Успешно", Ложь);
	Результат.Вставить("ТелоОтвета", "");
	Результат.Вставить("КодСостояния", 0);
	Результат.Вставить("ТекстОшибки", "");

	// Инициация: HTTP POST с телом запроса (аналогично HTTP)
	Соединение = СоздатьHTTPСоединениеMCP(ПараметрыСервера);
	ЗапросHTTP = Новый HTTPЗапрос(ПараметрыСервера.АдресЗапроса);

	ЗапросHTTP.Заголовки.Вставить("Content-Type", "application/json");
	ЗапросHTTP.Заголовки.Вставить("Accept", "text/event-stream");
	СформироватьЗаголовкиАвторизации(ЗапросHTTP, ПараметрыСервера.ТипАвторизации, КлючAPI);

	Для Каждого Заголовок Из ПараметрыСервера.Заголовки Цикл
		ЗапросHTTP.Заголовки.Вставить(Заголовок.Ключ, Заголовок.Значение);
	КонецЦикла;

	ЗапросHTTP.УстановитьТелоИзСтроки(ТелоJSON, КодировкаТекста.UTF8);

	ОтветHTTP = Соединение.ВызватьHTTPМетод("POST", ЗапросHTTP);
	Результат.КодСостояния = ОтветHTTP.КодСостояния;

	Если ОтветHTTP.КодСостояния <> 200 Тогда
		Результат.ТекстОшибки = СтрШаблон(
			НСтр("ru = 'HTTP-ошибка при обращении к MCP-серверу (SSE): %1'"),
			ОтветHTTP.КодСостояния);
		Возврат Результат;
	КонецЕсли;

	// Читаем полное тело SSE-ответа
	ПолноеТело = ОтветHTTP.ПолучитьТелоКакСтроку();

	// Парсинг SSE-событий из полного тела
	Строки = СтрРазделить(ПолноеТело, Символы.ПС);

	// Определяем ожидаемый id из тела запроса (для извлечения правильного ответа)
	ОжидаемыйИдентификатор = 1; // по умолчанию
	Попытка
		ЗапросJSON = ОбщегоНазначения.JSONВЗначение(ТелоJSON, , Ложь);
		Если ЗапросJSON.Свойство("id") Тогда
			ОжидаемыйИдентификатор = ЗапросJSON.id;
		КонецЕсли;
	Исключение
	КонецПопытки;

	ТелоОтветаРезультат = "";

	Для Каждого Строка Из Строки Цикл
		Строка = СокрЛП(Строка);
		Если Лев(Строка, 5) = "data:" Тогда
			Данные = СокрЛП(Сред(Строка, 6));
			Если ПустаяСтрока(Данные) ИЛИ Данные = "[DONE]" Тогда
				Продолжить;
			КонецЕсли;
			Попытка
				ДанныеJSON = ОбщегоНазначения.JSONВЗначение(Данные, , Ложь);
				Если ДанныеJSON.Свойство("id") И ДанныеJSON.id = ОжидаемыйИдентификатор Тогда
					ТелоОтветаРезультат = Данные;
				КонецЕсли;
			Исключение
				// Пропускаем некорректные фрагменты
			КонецПопытки;
		КонецЕсли;
	КонецЦикла;

	Если ПустаяСтрока(ТелоОтветаРезультат) Тогда
		Результат.ТекстОшибки = НСтр("ru = 'Не найдено JSON-RPC ответное сообщение в SSE потоке'");
		Возврат Результат;
	КонецЕсли;

	Результат.Успешно = Истина;
	Результат.ТелоОтвета = ТелоОтветаРезультат;
	Возврат Результат;

КонецФункции

// Создает HTTP-соединение для MCP-сервера
//
// Параметры:
//  ПараметрыСервера - Структура
//
// Возвращаемое значение:
//  HTTPСоединение
//
Функция СоздатьHTTPСоединениеMCP(ПараметрыСервера)

	Если ПараметрыСервера.ИспользоватьЗащищенноеСоединение Тогда
		ЗащищенноеСоединение = Новый ЗащищенноеСоединениеOpenSSL(Неопределено, Неопределено);
	Иначе
		ЗащищенноеСоединение = Неопределено;
	КонецЕсли;

	Возврат Новый HTTPСоединение(
		ПараметрыСервера.Адрес,
		, // порт по умолчанию
		ЗащищенноеСоединение,
		, // пользователь
		, // пароль
		, // таймаут (по умолчанию 30 сек)
		Неопределено // прокси
	);

КонецФункции

#КонецОбласти

#Область Авторизация

// Получает API-ключ MCP-сервера из безопасного хранилища
//
// Параметры:
//  MCPСервер - СправочникСсылка.КИИ_MCPСерверы
//
// Возвращаемое значение:
//  Строка - API-ключ (пустая строка если не установлен)
//
Функция ПолучитьКлючAPI(MCPСервер)

	КлючХранения = "MCP_" + Строка(MCPСервер.УникальныйИдентификатор());

	Попытка
		Ключ = ОбщегоНазначения.ПрочитатьДанныеИзБезопасногоХранилища(
			MCPСервер, КлючХранения);
		Если Ключ = Неопределено Тогда
			Возврат "";
		КонецЕсли;
		Возврат Строка(Ключ);
	Исключение
		ЗаписьЖурналаРегистрации(
			НСтр("ru = 'КИИ.MCP.КлючAPI'", ОбщегоНазначения.КодОсновногоЯзыка()),
			УровеньЖурналаРегистрации.Ошибка,
			Метаданные.Справочники.КИИ_MCPСерверы,
			MCPСервер,
			СтрШаблон(НСтр("ru = 'Ошибка чтения API ключа MCP-сервера: %1'"),
				ОбработкаОшибок.КраткоеПредставлениеОшибки(ИнформацияОбОшибке())));
		Возврат "";
	КонецПопытки;

КонецФункции

// Добавляет заголовки авторизации в HTTP-запрос
//
// Параметры:
//  ЗапросHTTP - HTTPЗапрос - запрос для добавления заголовков
//  ТипАвторизации - ПеречислениеСсылка.КИИ_ТипыАвторизации
//  КлючAPI - Строка
//
Процедура СформироватьЗаголовкиАвторизации(ЗапросHTTP, ТипАвторизации, КлючAPI)

	Если ПустаяСтрока(КлючAPI) Тогда
		Возврат;
	КонецЕсли;

	Если ТипАвторизации = Перечисления.КИИ_ТипыАвторизации.XApiKey Тогда
		ЗапросHTTP.Заголовки.Вставить("x-api-key", КлючAPI);
	Иначе
		// ApiKey, Bearer, OAuth2ClientCredentials -- все через Authorization: Bearer
		ЗапросHTTP.Заголовки.Вставить("Authorization", "Bearer " + КлючAPI);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ВспомогательныеФункции

// Возвращает параметры MCP-сервера для выполнения HTTP-запроса
//
// Параметры:
//  MCPСервер - СправочникСсылка.КИИ_MCPСерверы
//
// Возвращаемое значение:
//  Структура:
//    * Адрес - Строка
//    * АдресЗапроса - Строка
//    * ИмяПоляТекста - Строка ("text" по умолчанию)
//    * ИспользоватьЗащищенноеСоединение - Булево
//    * ТипАвторизации - ПеречислениеСсылка.КИИ_ТипыАвторизации
//    * ТипПодключения - ПеречислениеСсылка.КИИ_ТипПодключенияMCP
//    * Заголовки - Массив из Структура (Ключ, Значение)
//
Функция ПараметрыMCPСервера(MCPСервер)

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	КИИ_MCPСерверы.Ссылка КАК Ссылка,
		|	КИИ_MCPСерверы.Адрес КАК Адрес,
		|	КИИ_MCPСерверы.АдресЗапроса КАК АдресЗапроса,
		|	КИИ_MCPСерверы.ИмяПоляТекста КАК ИмяПоляТекста,
		|	КИИ_MCPСерверы.ИспользоватьЗащищенноеСоединение КАК ИспользоватьЗащищенноеСоединение,
		|	КИИ_MCPСерверы.ТипАвторизации КАК ТипАвторизации,
		|	КИИ_MCPСерверы.ТипПодключения КАК ТипПодключения
		|ИЗ
		|	Справочник.КИИ_MCPСерверы КАК КИИ_MCPСерверы
		|ГДЕ
		|	КИИ_MCPСерверы.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КИИ_MCPСерверыЗаголовки.Ключ КАК Ключ,
		|	КИИ_MCPСерверыЗаголовки.Значение КАК Значение
		|ИЗ
		|	Справочник.КИИ_MCPСерверы.Заголовки КАК КИИ_MCPСерверыЗаголовки
		|ГДЕ
		|	КИИ_MCPСерверыЗаголовки.Ссылка = &Ссылка";

	Запрос.УстановитьПараметр("Ссылка", MCPСервер);

	РезультатЗапроса = Запрос.ВыполнитьПакет();
	Выборка = РезультатЗапроса[0].Выбрать();

	Если Не Выборка.Следующий() Тогда
		ВызватьИсключение НСтр("ru = 'MCP-сервер не найден'");
	КонецЕсли;

	Результат = Новый Структура;
	Результат.Вставить("Адрес", Выборка.Адрес);
	Результат.Вставить("АдресЗапроса", Выборка.АдресЗапроса);
	Результат.Вставить("ИмяПоляТекста",
		?(ПустаяСтрока(Выборка.ИмяПоляТекста), "text", Выборка.ИмяПоляТекста));
	Результат.Вставить("ИспользоватьЗащищенноеСоединение", Выборка.ИспользоватьЗащищенноеСоединение);
	Результат.Вставить("ТипАвторизации", Выборка.ТипАвторизации);
	Результат.Вставить("ТипПодключения", Выборка.ТипПодключения);
	Результат.Вставить("Заголовки", Новый Массив);

	ВыборкаЗаголовки = РезультатЗапроса[1].Выбрать();
	Пока ВыборкаЗаголовки.Следующий() Цикл
		Заголовок = Новый Структура("Ключ, Значение");
		ЗаполнитьЗначенияСвойств(Заголовок, ВыборкаЗаголовки);
		Результат.Заголовки.Добавить(Заголовок);
	КонецЦикла;

	Возврат Результат;

КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли
